jayis1/daily-ideas/systems/soc-devices/aero-reed/firmware/sdkconfig.defaults
# Aero Reed — ESP-IDF sdkconfig defaults
# Target: ESP32-S3-WROOM-1-N8

# CPU / Flash
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y

# I2S
CONFIG_SOC_I2S_NUM=1
CONFIG_SOC_I2S_SUPPORTS_TX=y

# Bluetooth (BLE MIDI)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# USB (TinyUSB for USB MIDI)
CONFIG_TINYUSB_TASK_STACK=4096

# Partition table (NVS for patches)
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# SPI
CONFIG_SPI_MASTER_IN_IRAM=y

# ADC
CONFIG_ADC_ONESHOT_SOFT_FALLBACK_MODE=y

# I2C
CONFIG_I2C_ENABLE_DEBUG_LOG=n